/**
 * 公用正则
 * **/
const regExps = {
  NUMBER:/^[0-9]*$/,//数值
  DISCOUNT_RATE:/^(?:0\.\d+|[01](?:\.0)?)$/,//大于0小于1
 /* //数字 字母 下划线， 大小16个字符
  TABLE_NAME: /^[a-zA-Z0-9_]{0,16}$/i,*/

  //允许字符包括（中文，0---9，a---Z，下划线，中划线），首字符不允许是数值
  TABLE_NAME: /^[^0-9][0-9a-zA-Z\u4E00-\u9FA5\_]{4,49}$/,
  //允许字符包括（0---9，a---Z，下划线，中划线），首字符不允许是数值
  SYNCHRONIZE_TABLE_NAME: /^[^0-9][0-9a-zA-Z\_]{4,49}$/,
  NUMBER_RESTRICT:/^[0-9]+$/,//整数正则表达式
  /*//密码:至少包含一个数字,一个特殊字符
  PWD1: /^(?=.*[0-9])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{8,16}$/,
  //密码:至少包含大小写字母, 数字, 特殊字符 中的两个
  PWD: /^((?=.*[0-9])(?=.*[a-zA-Z])[a-zA-Z0-9!@#$%^&*]{8,16}$)|((?=.*[0-9])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{8,16}$)|((?=.*[a-zA-Z])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{8,16}$)|((?=.*[a-zA-Z])(?=.*[A-Z])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{8,16}$)$/,
*/
  //密码必须包含至少8个字符, 至少1个数字, 至少1个小写字母, 至少1个大写字母, 至少要有1个特殊字符(!@#$%^&)
  PWD: /^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#$%^&])[a-zA-Z0-9!@#$%^&]{8,}$/,
  //手机号
  PHONE: /^1[0-9]{10}$/,
  //邮箱
  EMAIL: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
  UPLOAD_SPLIT:/^[|]/
}

export default regExps;